一、for循环作业
1：输出99乘法表

2：经典冒泡排序利用for循环，完成a=[1,7,4,89,34,2]的冒泡排序。
冒泡排序：小的排前面，大的排后面

3：有1,2,3,4这四个数字，能组成多少个互不相同且无重复数字的三个数？分别是什么？
提示：123，321就是符合要求，数字既不相同，而且每个数字的个十百位也不重复；而121,212就不行，因为数字的各位与百位重复

4：请用嵌套for循环输入如下直角三角形
*
**
***
****
*****

5：请用嵌套for循环输出如下等边三角形（三个边均是5个*）
*
* *
* * *
* * * *
* * * * *

四、for..range练习：

1：利用for循环和range找出 0 ~ 100 以内所有的偶数，并追加到一个列表。

2：利用for循环和range 找出 0 ~ 50 以内能被3整除的数，并追加到一个列表。

3：利用for循环和range 找出 0 ~ 50 以内能被3整除的数，并插入到列表的第0个索引位置，
最终结果如下：
[48,45,42...]

4：查找列表li中的元素，移除每个元素前后的空格，并找出以”a”开头的元素，添加到一个新列表中,
最后循环打印这个新列表。
li = ["alexC", "AbC ", "egon", " riTiAn", "WuSir", " aqc"]

